; domain
(define (domain towels)
  (:requirements :strips :typing)
  (:types towel location)

  (:predicates 
    (at ?towel - towel ?loc - location)
    (folded ?towel - towel)
    (in-closet ?towel - towel)
    (on-rack ?towel - towel)
    (smaller ?towel - towel)
    (thicker ?towel - towel)
    (emptiness ?towel - towel)
    (openness ?towel - towel))

  (:action fold-lengthwise
    :parameters (?towel - towel)
    :precondition (and (not (folded ?towel)) (not (smaller ?towel)))
    :effect (and (folded ?towel) (smaller ?towel)))

  (:action fold-half-twice
    :parameters (?towel - towel)
    :precondition (and (folded ?towel) (smaller ?towel) (not (thicker ?towel)))
    :effect (and (thicker ?towel)))

  (:action store-in-closet
    :parameters (?towel - towel)
    :precondition (and (thicker ?towel) (not (in-closet ?towel)) (not (emptiness ?towel)))
    :effect (and (in-closet ?towel) (emptiness ?towel)))

  (:action hang-on-rack
    :parameters (?towel - towel)
    :precondition (and (in-closet ?towel) (folded ?towel) (not (on-rack ?towel)) (emptiness ?towel))
    :effect (and (on-rack ?towel) (not (folded ?towel)) (openness ?towel))))

; problem
(define (problem towel-folding)
  (:domain towels)
  (:objects 
    towel1 - towel
    linen_closet towel_rack outside - location)

  (:init 
    (at towel1 outside)
    (not (folded towel1))
    (not (smaller towel1))
    (not (thicker towel1))
    (not (in-closet towel1))
    (not (on-rack towel1))
    (not (emptiness towel1))
    (not (openness towel1)))

  (:goal 
    (and
      (on-rack towel1)
      (openness towel1))))

; plan
1. (fold-lengthwise towel1)
   added: (folded towel1) (smaller towel1)
   goals met: 0 of 2
2. (fold-half-twice towel1)
   added: (thicker towel1)
   goals met: 0 of 2
3. (store-in-closet towel1)
   added: (in-closet towel1) (emptiness towel1)
   goals met: 0 of 2
4. (hang-on-rack towel1)
   deleted: (folded towel1)
   added: (on-rack towel1) (openness towel1)
   goals met: 2 of 2
